---
type: IFCFileWriteOptions
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 5
tags: [revit-api, class]
---

# IFCFileWriteOptions

`Autodesk.Revit.DB.IFC.IFCFileWriteOptions` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IFCFileWriteOptions | 2013 | `public IFCFileWriteOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | FileFormat | 2013 | `public IFCFileFormat FileFormat { get ; set ; }` |
| Property | FileName | 2013 | `public string FileName { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |